test/liquid_solid_fluidized_bed_semi/force_buoyancy+drag/SchillerNaumann/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 0.1;

vertices
(
  (0.353554    0.353554    0)    // 0
  (-0.353554    0.353554    0)   // 1
  (-0.353554    -0.353554    0)  // 2
  (0.353554    -0.353554    0)   // 3
  (0.25     0.25     0)          // 4
  (-0.25     0.25     0)         // 5
  (-0.25     -0.25     0)        // 6
  (0.25     -0.25     0)         // 7
  (0.353554    0.353554    8)    // 8
  (-0.353554    0.353554    8)   // 9
  (-0.353554    -0.353554    8)  // 10
  (0.353554    -0.353554    8)   // 11
  (0.25     0.25     8)          // 12
  (-0.25     0.25     8)         // 13
  (-0.25     -0.25     8)        // 14
  (0.25     -0.25     8)         // 15
);

blocks
(
  /*
  hex (4 5 6 7 12 13 14 15) (16 16 256) simpleGrading (1 1 1)
  hex (0 1 5 4 8 9 13 12) (16 8 256) simpleGrading (1 1 1)
  hex (1 2 6 5 9 10 14 13) (16 8 256) simpleGrading (1 1 1)
  hex (2 3 7 6 10 11 15 14) (16 8 256) simpleGrading (1 1 1)
  hex (3 0 4 7 11 8 12 15) (16 8 256) simpleGrading (1 1 1)
   */
  hex (4 5 6 7 12 13 14 15) (20 20 320) simpleGrading (1 1 1)
  hex (0 1 5 4 8 9 13 12) (20 10 320) simpleGrading (1 1 1)
  hex (1 2 6 5 9 10 14 13) (20 10 320) simpleGrading (1 1 1)
  hex (2 3 7 6 10 11 15 14) (20 10 320) simpleGrading (1 1 1)
  hex (3 0 4 7 11 8 12 15) (20 10 320) simpleGrading (1 1 1)
);

edges
(
  arc 0 1 (0 0.5 0)    // e0
  arc 1 2 (-0.5 0 0)   // e1
  arc 2 3 (0 -0.5 0)   // e2
  arc 3 0 (0.5 0 0)    // e3
  arc 8 9 (0 0.5 8)    // e4
  arc 9 10 (-0.5 0 8)  // e5
  arc 10 11 (0 -0.5 8) // e6
  arc 11 8 (0.5 0 8)  // e7
);

patches
(
  wall inlet
  (
    (4 5 6 7)
    (0 1 5 4)
    (1 2 6 5)
    (2 3 7 6)
    (3 0 4 7)
  )
  wall walls
  (
    (0 8 9 1)
    (1 9 10 2)
    (2 10 11 3)
    (3 11 8 0)
  )
  wall outlet
  (
    (12 13 14 15)
    (8 9 13 12)
    (9 10 14 13)
    (10 11 15 14)
    (11 8 12 15)
  )
);
